cdiscountapi/tests/cassettes/test_fulfillments/test_get_product_stock_list.yaml

interactions:
- request:
    body: '<?xml version=''1.0'' encoding=''utf-8''?>

      <soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Header
      xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action>http://www.cdiscount.com/IMarketplaceAPIService/GetProductStockList</wsa:Action><wsa:MessageID>urn:uuid:c905097e-6ac7-46fe-bf01-07fc3be0eec0</wsa:MessageID><wsa:To>https://wsvc.cdiscount.com/MarketplaceAPIService.svc</wsa:To></soap-env:Header><soap-env:Body><ns0:GetProductStockList
      xmlns:ns0="http://www.cdiscount.com"><ns0:headerMessage><ns1:Context xmlns:ns1="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages"><ns1:CatalogID>1</ns1:CatalogID><ns1:SiteID>100</ns1:SiteID></ns1:Context><ns2:Localization
      xmlns:ns2="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages"><ns2:Country>Fr</ns2:Country></ns2:Localization><ns3:Security
      xmlns:ns3="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages"><ns3:DomainRightsList
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns3:IssuerID
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns3:SessionID
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns3:TokenId>51deaf6bd07f4cee8aebd96885a978a2</ns3:TokenId><ns3:UserName></ns3:UserName></ns3:Security><ns4:Version
      xmlns:ns4="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages">1.0</ns4:Version></ns0:headerMessage><ns0:request><ns5:BarCodeList
      xmlns:ns5="http://schemas.datacontract.org/2004/07/Cdiscount.Service.Marketplace.API.External.Contract.Data.Product"><ns6:string
      xmlns:ns6="http://schemas.microsoft.com/2003/10/Serialization/Arrays">3515450012475</ns6:string></ns5:BarCodeList></ns0:request></ns0:GetProductStockList></soap-env:Body></soap-env:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '1864'
      Content-Type:
      - text/xml; charset=utf-8
      SOAPAction:
      - '"http://www.cdiscount.com/IMarketplaceAPIService/GetProductStockList"'
      User-Agent:
      - Zeep/3.3.1 (www.python-zeep.org)
    method: POST
    uri: https://wsvc.cdiscount.com/MarketplaceAPIService.svc
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\"><s:Body><GetProductStockListResponse\
        \ xmlns=\"http://www.cdiscount.com\"><GetProductStockListResult xmlns:a=\"\
        http://schemas.datacontract.org/2004/07/Cdiscount.Service.Marketplace.API.External.Contract.Data.Product\"\
        \ xmlns:i=\"http://www.w3.org/2001/XMLSchema-instance\"><ErrorMessage xmlns=\"\
        http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages\"\
        >Vendeur d\xE9sactiv\xE9</ErrorMessage><OperationSuccess xmlns=\"http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages\"\
        >false</OperationSuccess><ErrorList/><SellerLogin i:nil=\"true\"/><TokenId\
        \ i:nil=\"true\"/><a:ProductStockList i:nil=\"true\"/><a:Status>KO</a:Status><a:TotalProductCount>0</a:TotalProductCount></GetProductStockListResult></GetProductStockListResponse></s:Body></s:Envelope>"
    headers:
      Content-Length:
      - '853'
      Content-Type:
      - text/xml; charset=utf-8
      Date:
      - Mon, 15 Apr 2019 14:05:08 GMT
    status:
      code: 200
      message: OK
version: 1
